{'docstore': 
{'__data__': {'docs': {'0b6d768e-1570-45ad-a3a1-c91bbfa6dfd2': {'text': "BASS COAST\n\nDINOSAURS TRAIL\n\nMASTERPLAN\n\nHassell ©\n\nHassell\n\n61 Little Collins Street\n\nMelbourne\n\n3000\n\nhassellstudio.com\n\n@hassell_studio\n\nContact\n\nAdam Gardner\n\nLandscape Architect\n\nagardner@hassellstudio.com\n\n+61 3 8102 3084\n\nMark Haycox\n\nPrincipal\n\nmhaycox@hassellstudio.com\n\n+61 3 8102 3133\n\nDate\n\nApproved By\n\nDescription\n\n11.05.2021\n\n08.06.2021\n\n02.07.2021\n\n30.07.2021\n\n13.09.2021\n\nBB\n\nMH/BB\n\nBB\n\nBB\n\nMH\n\nFor discussion\n\nFor information\n\nFor information\n\nFor information\n\nFor approval\n\nDocument Control\n\nRev\n\n01\n\n02\n\n03\n\n04\n\n05\n\n2\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nCONTENTS\n\nIntroduction\n\n1. 2. Precinct Overview 3. 4. 5. 6. 7. 8. 9.\n\nSan Remo\n\nKilcunda\n\nWonthaggi\n\nEagles Nest\n\nThe Caves\n\nInverloch\n\nAppendix\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n3\n\nWe recognise that this project area is situated on the traditional lands of the Bunurong; members of the Kulin Nation who have lived here for thousands of years. We pay our respects and acknowledge Bunurong ancestors, Bunurong elders and the Bunurong community. We offer our respect to their elders past and present and through them, all Aboriginal and Torres Strait Islander people.\n\nBunurong Land Council Aboriginal Corporation has been engaged with the master planning process for the Bass Coast Dinosaurs Trail, and we acknowledge that this commitment is fundamental. Through this project, we aim to continue nurturing this relationship, and find adequate opportunities to transmit and safeguard Bunurong cultural heritage and cultural values.\n\nINTRODUCTION\n\nApproximately 125 million years ago, the Bass Coast was a landscape occupied by a unique and diverse range of polar dinosaurs and prehistoric fauna.\n\nDuring this period Australia was still firmly attached to Antarctica and this area would have looked very different to what it looks like today; instead of cliffs and sea, there was a wide geological rift valley with mountain ranges to the north and south. Over time rift gradually widened and filled with sand, mud and gravel sediment deposited by ancient rivers and lakes and it is in these deposits that the fossils of Australian dinosaurs have been found.\n\nThis document is the first step towards creating a Masterplan that celebrates and educates users about the uniqueness of polar dinosaur fossils, their history and the prehistoric fauna found in the region.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n7\n\nBore Beach, San Remo. Image: Hassell\n\nVISION\n\nAmplify the Bass Coast region’s pre-historic past and to elevate it as a unique and exciting tourism destination.\n\nWhat? How?An experience of dinosaur discovery, learning and creativity. A journey\n\nthat links together history, community, culture and environment.\n\n8\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nSETTING THE SCENE\n\nIn the Early Cretaceous period, approximately 125 million years ago, Australia lay alongside Antarctica and was known as Gondwana, which also included South America, India and Africa. During this time what is now known as the state of Victoria, lay well inside the Antarctic Circle.\n\nThe southern supercontinent hosted an assemblage of animals and plants that lived under climate conditions having no modern analogue. The average temperature appears to have ranged from frigid to low temperate. Through the long winter, the sun did not shine for weeks or months at a time.\n\nThe continents began to break up more than 100 million years ago, when a rift valley formed between what would become Australia and Antarctica. Stream channels in the valley accumulated bones gathered by floodwaters that periodically swept these broad plains. The bones, together with muds, gravels, sand and silt, produced the fossil-bearing formations of the Bass Coast.\n\nSource: Vickers-Rich, P. and Rich, T., 2014. Dinosaurs of Polar Australia. Scientific American, pp.46-53 Vickers-Rich, P. and Rich, T., 2020. Dinosaurs of Darkness: In Search of the Lost Polar World. Indiana University Press\n\nGONDWANA 125\n\nMILLION YEARS AGO\n\nAUSTRALIA TODAY\n\n1 2 5 MILLION YEARS\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n9\n\nPURPOSE\n\nThe Bass Coast Dinosaurs Trail (BCDT) will reinforce the Bass Coast region as a year-round tourism destination and provide a unique attraction that draws upon the region's heritage. The project will provide a platform that improves the infrastructure for better amenity, accessibility and encourages sustained cultural tourism - continuing to unlock the potential of the coast and to open up visitation and tourism activity across the whole year.\n\nCulture The trail will draw together existing scientific, historical, cultural and educational tourism experiences into one cohesive offer that can become an integral part of the communities who live, work and visit the area. It will present engaging heritage interpretation, reveal stories and establish new places for education, cultural expression and social gathering.\n\nIn future development stages, the Bass Coast Dinosaurs Trail will continue to engage with Traditional Owners and seek opportunities for interpretation and management of Aboriginal Cultural Heritage.\n\nEnvironment The project will protect, enhance and promote responsible use of the coastal environment, providing opportunity to educate visitors on the significance and diversity of the natural environment.\n\nThrough careful consideration, the trail will protect the environmental values of the Bass Coast region whilst catering for the increased visitation demand and changing visitor uses. The project provides Council with an opportunity to further collaborate with Parks Victoria, DELWP and Traditional Owners/ custodians of the land to ensure its conservation and sustainable use.\n\nThe BCDT is positioned to leverage from and support other strategic investments in planning underway in the region including the Yallock-Bulluk Marine and Coastal Park. These and other initiatives comprise a portfolio of projects that diversify the visitor experience and upgrade the amenity and services to support that offer.\n\nEconomy The region's local economy and small businesses are supported by the visitor economy and an investment in the Bass Coast Dinosaurs Trail will contribute to continued economic growth.\n\nTourism is in the top three sectors for economic output and local jobs in Bass Coast. Local jobs will be sustained and created through additional investment.\n\nFurther economic modelling will determine the direct jobs generated by the investment in establishing the trail, including the positive spin- offs, the flow-on industrial effects in terms of local purchases of goods and services, consumption effects and the employment multiplier.\n\n10\n\nRockpools, The Caves Beach. Image: Hassell\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nMASTERPLAN ROADMAP\n\nThe purpose of this document is to outline the scope and project delivery requirements of the Dinosaurs Trail. It will serve as a strategic roadmap and provide a framework that will curate the delivery of the experiences over time by different groups.\n\nThe Masterplan will document the overall vision, design framework, site planning, design narrative for each location and supporting strategies for the trail. This includes; scope, creative design responses, the location of artworks, way finding, interpretation and curatorial framework for each of the six identified project sites. It will identify the associated infrastructure, maintenance, transport and movement required to deliver the works.\n\nFunding The Masterplan will serve as an advocacy document for building sustainable regional tourism and assist with future State and Federal governments funding opportunities.\n\nFuture stages will actively seek an initial allocation from State and Federal sources to complete the future phases of the project.\n\nSEPTEMBER\n\n2021\n\nIncorporate Council +\n\nStakeholder Feedback\n\nApplication for all Permits + Permissions\n\nCouncil, Stakeholder +\n\nCommunity Consultation\n\nMasterplan Final Review +\n\nUpdate\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n11\n\nCREATIVE RESPONSES FOR SIX SITES JUNE2021SUBJECT TO FUTURE FUNDINGAPRIL2021Preliminary Site Analysis ReportCouncil + Stakeholder Consultation Draft Design Concepts For Each SiteProcurement + Installation of Artworks at Each SiteCouncil + Stakeholder Consultation Community ConsultationCost Plan + Visitor Economy Development\n\nCREATIVE OPPORTUNITIES\n\nTHE TRAIL IS COMPRISED OF FOUR KEY CREATIVE ELEMENTS As identified in the Bass Coast Dinosaurs Trail Creative Opportunities Brief, each site will provide opportunity to create unique and engaging works of resonance and explore science, landscape, imagination and culture. Creative elements are encouraged to explore various levels of engagement, experience and learning for the communities who live, work and visit the area.\n\nTell people and they may forget, Show them and they may remember Involve them and they will understand\n\nArtist's Brief The Masterplan will provide strong guidance to specific location(s), narratives, themes and curatorial drivers for each work. It is the role of the artist to provide creative propositions that respond to this brief for further development. With a curatorial framework, artists are encouraged to move beyond literal depictions and works should explore the depth of knowledge, science, landscape, imagination and culture.\n\nEach site is unique and works should reflect the significance and diversity of their location and its history. It is recommended that artists understand and engage with the scientific practices they are trying to communicate. Ongoing engagement with the scientific community is integral to the success of the trail experience to ensure accuracy and correctness throughout all creative responses.\n\n12\n\nWAYFINDING +\n\nINTERPRTATION\n\n– Signage\n\n– Artwork\n\n– Education\n\n– Storytelling\n\n– Discovery\n\nEVENTS\n\n– Dino Digs\n\n– School events\n\n– Community\n\nevents\n\n– Retail\n\nconnections\n\nExtensive interpretive way finding reflecting and expressing the science, local significant stories and values of Traditional Owners. Opportunity for integration with the proposed Yallock Bulluk infrastructure and access plan.\n\nA ‘dig’ festival steered by community and held every two years as a community celebration of music and art.\n\nBASS COAST\n\nDINOSAURS TRAIL\n\nProvision of a supporting digital platform to explore more stories with links to research and learning.\n\nDIGITAL\n\nPLATFORMS\n\n– Mobile Apps\n\n– Augmented\n\nReality\n\n– Virtual Exp.\n\n– Light and\n\nProjection\n\nArtwork and installations\n\nto explore, science,\n\nlandscape, imagination\n\nand culture through a\n\nvariety of approaches.\n\nART\n\nPROJECTS\n\n– Sculpture\n\n– Nature Play\n\n– Soundscapes\n\n– Kinetic Work\n\n– Temporary\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nHERO DINOSAURS\n\n'Ankylosaurus'\n\nLarge Therapod\n\n'Koolasuchus'\n\nSite: Inverloch\n\nType: Ankylosaur\n\nSize: 3.0m (L) 1.0m(H)\n\nWeight: 1,500kg\n\nDiet: Herbivore\n\nSite: Eagles Nest\n\nType: Carnosaur\n\nSize: 6.0m (L) 2.0m(H)\n\nWeight: 350kg\n\nDiet: Carnivore\n\nSite: San Remo Type: Amphibia Size: 4.5m (L) x 1.0m (H) Weight: 500kg Diet: Carnivore\n\nAnkylosaurs were heavy-bodied, quadrupedal herbivores. They were armoured for protection against predators which included belly armour and scutes, spikes and dermal ossicles over the neck and trunk. It did not have a clubbed tail and, unlike almost all other Ankylosaurs, had no dermal armour on the skull. It is likely that Anklosaurus ate the cones of podocarps as well as ferns and other soft-leaved plants.\n\nA top predator during the Early Cretaceous period, this speedy dinosaur had huge claws on its hands and slender-toed feet, and has been described as the cheetah of Cretaceous Australia. Whilst better known from Queensland, one of its claws was found near Cape Otway indicating that the natural range of this genus once included Victoria. Compared to other Australian carnivorous dinosaurs, we have the most complete fossil record for this species.\n\nKoolasuchus cleelandi was a large amphibian with ornamented bones and teeth that was first discovered by Mike Cleeland and prepared by Lesley Kool near San Remo in 1990. The Koolasuchus lived in the same polar region as the dinosaurs, 125 million years ago and is one of the last temnospondyl species to survive up into the Cretaceous period. At 3 meters long, it may have preyed on some of the smaller ornthithopod dinosaurs as well as large fish from its cool aquatic environment\n\n'Qantassaurus'\n\n'Serendipaceratops'\n\nSite: The Caves Type: Ornithopod Size: 1.8m (L) x 1.0m (H) Weight: 45kg Diet: Herbivore\n\nSite: Kilcunda\n\nType: Ceratopsian\n\nSize: 2.0m (L) 1.0m(H)\n\nWeight: 350kg\n\nDiet: Herbivore\n\nQantassaurus interpidus was a small herbivorous dinosaur, about the size of a kangaroo – discovered by Nicole Everard in 1994 at the Dinosaur Dreaming site at Inverloch, Victoria. Named after the Australian airline Qantas, in recognition of the role the airline played in helping to transport the Great Russian Dinosaurs exhibition around Australia in 1993. Qantassaurus had to cope with the long periods of Antarctic winter darkness and have survived temperatures well below 0 degrees Celsius.\n\nSerendipaceratops arthurcclarkei was discovered by Mike Cleeland at the Arch, near Kilcunda, in the Strzelecki formation, Victoria in 1993. It is the first representative of the ceratopsians to be found in Australia. The only known bone of Serendipaceratops is an ulna (forearm bone) and it is widely agreed that it is a primitive species of horned/frilled dinosaur like Protoceratops.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n13\n\nSITE LOCATIONS\n\nDINOSAURS", 'doc_id': '0b6d768e-1570-45ad-a3a1-c91bbfa6dfd2', '__type__': '1', 'doc_hash': '7416c837cf315bd30c7e319a0cbc0e451f9faa693c044e9f17373b36d0e6519d', 'embedding': None, 'node_info': {'end': 13800, 'start': 0
        }, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '3': 'fb9fc146-1245-4985-a92e-5ae4bf333e5f'
                    }
        }, 'bb5d3ec5-8311-45b0-9e4e-9807d19368e0': {'text': "to incorporate intergrated dinosaur themed play or sculpture Carpark to be considered for shuttle bus pick up/drop off locatio\n\nPhysical site locator/wayfinding\n\nKey sightline from Phillip Island Rd to capture 'incidental' visitors\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nSAN REMO\n\nFORESHORE\n\nRESERVE\n\nPHILLIP ISLAND RD\n\nMARINE PARADE\n\nCONNECTION TO\n\nSAN REMO SHOPS\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n63\n\n0\n\n50\n\n100m\n\nTHE ENTIRE DINOSAUR EXPERIENCE\n\nA Regional Tourism Experience The Bass Coast Dinosaurs Trail provides a new regional tourism offering that compliments existing destinations, infrastructure, environmental and cultural offerings within the region. The experience will generate enthusiasm in different parts of the region, drawing new and existing visitors deeper into the communities and economies of the Bass Coast.\n\nVisitors that come to experience the Dinosaurs Trail are likely to expand their activities into townships and the regional context; increasing visitation throughout the year; encouraging flow on private investment; promoting active recreation opportunities, and ultimately raising the brand profile of the region.\n\nThe Bass Coast Dinosaurs Trail will peel back the layers of earth, life and time over millions of years and discover the uniqueness of polar dinosaur fossils, their history and the prehistoric fauna found in the region.\n\nCommunity Engagement Consultation with stakeholders and Bass Coast community has been undertaken throughout all phases and milestones of the project’s delivery.\n\nThis purpose of the Masterplan is to outline the scope and project delivery requirements of the Bass Coast Dinosaurs Trail, providing a strategic framework and guidance to the specific location(s), narratives, themes and curatorial drivers for each site’s future creative art proposals and design responses.\n\nIt is the role of the artist to provide creative propositions that respond to this brief for further development. With a curatorial framework, artists are encouraged to move beyond literal depictions and works should explore the depth of knowledge, science, landscape, imagination and culture.\n\nThe narrative and experience of each site has been approached to enable each location to tell it’s own individual story, based on its unique prehistoric, environmental and cultural layers The experience of one site differs to another although when combined the overall collective experience is amplified and all six sites present a connected journey of dinosaur discovery, exploration and learning.\n\nOngoing engagement with the scientific community is integral to the success of the trail experience to ensure accuracy and correctness throughout all creative responses.\n\nDuring the community engagement phase, we engaged with: – Over 60 people who attended drop in sessions. All were members of local community;\n\n– With online consultation, about\n\n100 people shared their feedback for the Bass Coast Dinosaurs Trail Masterplan document;\n\n– Three targeted consultation sessions were run, with over 30 community members. Representatives were from history, arts & culture and natural environment groups;\n\n– Science and research – the Dino\n\nHunters have been part of the project development from the beginning and have had extended analysis and input on the Masterplan document; and\n\n– Meetings with partners from\n\nBunurong Land Council Aboriginal\n\nCorporation, Parks Victoria and\n\nDELWP.\n\nProject Governance Groups\n\nThe following guidance and overview was provided by the project governance groups: – Project Control Group met four times\n\nover the course of six months;\n\n– Project Working Group met four times\n\nover the course of six months;\n\n– Internal Reference Group met four\n\ntimes over the course of six months, with additional smaller catch ups as per area of contributing expertise.\n\n64\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nSAN REMO\n\nKILCUNDA\n\nWONTHAGGI\n\nTHE CAVES\n\nINVERLOCH\n\nEAGLES NEST", 'doc_id': 'bb5d3ec5-8311-45b0-9e4e-9807d19368e0', '__type__': '1', 'doc_hash': 'da1edb3c7623260de474e40d100b54080ff9586fe2f9ad6681ff1cb2c87d92ed', 'embedding': None, 'node_info': {'end': 70115, 'start': 66074
                    }, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '2': 'e40ffff6-1b66-4f0c-a22f-d988007aafab'
                    }
        }, 'cbcd5a2b-559c-4920-b41e-46a07632c0d8': {'text': 'Considerations 1. Relationship and proximity to\n\nBunurong Environment Centre and\n\ncarpark\n\n2. Existing Wyeth\n\n\n\nMcNamara Park\n\nshelter, BBQ and seating facilities\n\n3. Ramsey Boulevard parking\n\n4. Wyeth\n\n\n\nMcNamara Park playground\n\nFuture upgrades proposed 2022\n\n\n\n23\n\n5. Existing gym station and exercise\n\nequipment\n\n6. The Glade shelter, BBQ and picnic\n\nfacilities\n\n7. Open lawn of the glade to be\n\nretained. Location of Inverloch\n\nCommunity Farmers Market\n\n8. Existing boardwalk access to\n\nInverloch Beach\n\nWyeth-McNamara Park This site is all about immersing visitors in scientific enquiry and discovery. Highly sensory and participatory, the installations invite visitors to investigate, inquire, experiment, uncover, ponder, wonder and imagine. Visitors become the prospector, palaeontologist, preparator or paleoartist.\n\nFuture plans to upgrade and redevelop Wyeth-McNamara Park provide the canvas to include a dinosaur narrative through play, sculpture and user engagement. The park’s proximity to the Bunurong Environment Centre provides an opportunity to engage schools and connect with public events.\n\nThe site also provides opportunity for a Museum/ Cultural Centre to be developed in Inverloch, a space for community participation, as well as ongoing education and research and ensure the sustainability of the Bass Coast Dinosaurs Trail.\n\nInverloch is an ideal place to explore the science that underpins the entire dinosaurs trail. The form of the hero dinosaur could reflect the idea that what we know about polar dinosaurs is a result of years of study, painstakingly pieced together.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n29\n\n0\n\n25\n\n50m\n\nRAMSEY BLVDTHE ESPLANDE\n\nINVERLOCH\n\nSCIENCE, ART AND IMAGINATION...\n\nENGAGING USERS IN THE PROCESS OF FINDING, IDENTIFYING EXCAVATING, PREPARING, AND RECONSTRUCTING FOSSILS\n\nHow it could look\n\n1. Wyeth\n\n\n\nMcNamara Park playground\n\nuses scientific enquiry as a launching pad for play, where children are invited to ponder, experiment and make their own discoveries. Sculptural elements and hidden fossils await discovery as families explore and investigate their way through this adventure-fuelled play space.\n\n2. Sculptural and artististic\n\ninstallations to be integrated with nature based play and the proposed upgrade of Wyeth-McNamara Park playground. Artistic interpretation of dinosaur features and elements provides opportunity for climbing, swinging, sliding and engagement with the surrounding landscape.\n\n3. Footprints of Galleonasaurs act as wayfinding and navigation tools to direct people from the township into the play space. Different species of dinosaur and their footprints lead to different elements of nature play within the space and encourage children to explore and discover. The re-imagined playground compliments the development of a future polar dinosaur ‘hub’ with fossil displays, interactive exhibits and on-display preparation lab, proposed nearby.\n\n30\n\nPrecedents 1. Fossil Hunters nature playground, Naracoorte Caves National Park 2. Centenary Lakes nature playground,\n\nCarins by Landplan\n\n3. Stegosaurus rock climbing wall,\n\nMegasaurus Playground by Urban\n\nEdge Landscape Architects\n\nImage: Claire Lock\n\nImage: Andrew Watson\n\n2.\n\nImage: Urban Edge Landscape Architects\n\n1.\n\n3.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nRAMSEY BOULEVARD\n\nLINK TO CARPARK\n\nKey Moves – Play space to provide a variety of nature play experience and challenges for a variety of different age groups.\n\n– Situated between and under existing\n\ntrees, canopy cover and open air will provide a diversity of play experiences.\n\n– Provide clear visual and pedestrian connection between play space and Bunurong Environment Centre. – Access to existing carpark, shelter and open lawn to be retained and enhanced.\n\n– Navigation and wayfinding elements to be incorporated into the space, highlighting dinosaur trail elements and enhance connections through to town centre\n\nLegend\n\nPlayground extent\n\nJunior play; located close to existing facilities\n\nSenior play\n\nIntermediate play\n\nIntermediate play; with connection\n\nto Environment Centre\n\nSculptural and intergrated dinosaur\n\nthemed play elements\n\nPhysical site locator/wayfinding\n\nFuture museum and cultural\n\ncentre\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nACCESS TO TOWN CENTRE\n\nCONNECTION TO BUNURONG\n\nENVIRONMENT CENTRE\n\nFUTURE M\n\nCULTURAL CENTRE\n\nUSEU\n\nM AND\n\nE\n\nC\n\nA\n\nP\n\nN S\n\nE\n\nP\n\nE O\n\nD\n\nA\n\nL\n\nO G\n\nS T\n\nS\n\nE\n\nC\n\nC\n\nA\n\nINVERLOCH COASTAL\n\nRESERVE\n\nC\n\nO\n\nN\n\nN\n\nE\n\nC\n\nT\n\nI\n\nO\n\nN\n\nT\n\nO\n\nB\n\nE\n\nA\n\nC\n\nH\n\n0\n\n12.5\n\n25m\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n31\n\nTHE CAVES\n\nPASSION AND PERSEVERANCE...\n\nA CELEBRATION OF THE TIRELESS WORK AND THE PEOPLE BEHIND THE INCREDIBLE DISCOVERIES OF POLAR DINOSAUR FOSSILS\n\nKey Cultural Interests\n\nCelebrating the tireless effort and continually work of the volunteers and community involved with dinosaur discoveries along the Bass Coast. Providing stories and insights into their passion, perseverance and experiences.\n\nDramatic coastal views, geological rock formations and intertidal Cretaceous rock platforms all contribute to this site\'s character and should be expressed.\n\nStory We wouldn’t know anything about the polar dinosaurs if it wasn’t for the people who continue to discover them.\n\nFrom William Ferguson’s discovery of Australia’s first dinosaur fossil in 1903, to the tireless work of the ‘700’ volunteers of the Dinosaur Dreaming project today and those that support them, the people behind the incredible discoveries will be revealed.\n\nThe challenging nature of the work at this site makes their valuable discoveries even more remarkable. Thousands of hours of hard, rock- breaking work go into the discovery of a fossil. Personal stories, told by the Dinosaur Dreamers themselves, will provide heartfelt, individual insights into discovering dinosaurs and how the thrill of these discoveries fuels their passion and perseverance. “The rock is hard, and the yield is low.” Thomas Rich"\n\n34\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©PASSIONPERSEVERANCEHassell ©\n\nSite Personality The site is located within the Yallock- Bulluck Marine and Costal Park (a marine protected area) and is to be treated sensitively and protected. The creative response should be small- scale, compelling and have a light touch on the ground. Where possible, landscape enhancements and digital elements along the existing beach access pathway provide opportunity for users to engage with the stories of the Dinosaur Dreamers, past, present and future.\n\nAccess to the site is via a small carpark, a steep staircase, descends onto a rock platform which is largely covered by water at high tide. Rather than be a hinderance to the trail, these limitations provide an ideal backdrop to appreciate the challenging work undertaken at the site. The planning restrictions limit installation opportunity with a focus on updating signage, suggesting something more personal in scale and nature.\n\nSite Considerations 1. Potential intersection to upgrades improve safety and traffic flow into carpark\n\n2. Existing carpark. Recommended\n\nupgrade and redesign\n\n3. Discovery \'hot spot\'; fossils,\n\nfootprints, petrified wood, coal seams and natural rock formations all in this location\n\n4. Existing polar dinosaur history, palaeontology discovery and narrative signage (outdated). Opportunity for digital replacements\n\n5. Stair access down to beach and rock shelf. Sculptural elements along path edges would provide acitvation and engagement\n\n6. Beach access to rock pools and\n\ndinosaur dig site\n\n7. Beach access to The Caves\n\n1\n\n3\n\nSTAIRS AND\n\nBEACH ACCESS\n\n4\n\n6\n\n2\n\n5\n\n7\n\n0\n\n25\n\n50m\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n35\n\nCAPE PATERSON\n\n\n\nINVERLOCH RD\n\nTHE CAVES\n\nPASSION AND PERSEVERANCE...\n\nA CELEBRATION OF THE TIRELESS WORK AND THE PEOPLE BEHIND THE INCREDIBLE DISCOVERIES OF POLAR DINOSAUR FOSSILS\n\nHow it could look 1. Sculptural elements and forms\n\nPrecedents 1. Dinosaur Coast Track Guide mobile\n\napplication, Broome\n\n2. Dinosaur Dreaming fossil dig at Flat\n\nRocks, Inverloch\n\n3. Theropod footprint, Dinosaur Coast,\n\nBroome\n\n4. Stone etched QR code, Source\n\nUnknown\n\nprovide sense of arrival from the site\'s existing carpark, accompanied by digital platforms that provide an explanation to dinosaur experience at The Caves. Installations of different size and forms are located at the critical node and viewpoint of the path as users descend down the stairs. Each element invites closer exploration, encouraging users to stop and engage with the stories of the volunteers and the surrounding environment.\n\n2. Digital platforms and QR codes bring an installation to life, revealing the story of the rock-breaking work that happens along the rock platform below, the challenging conditions in which the discovers are made, and the dedicated people and partners that make it all possible. Visitors can ‘meet’ some of these people and hear about the personal experiences at the site.\n\n3. The virtual treasure hunt; a digital platform allows visitors to become a palaeontologist themselves, encouraging exploration and searching for hidden treasures throughout the site. The digital platform emphasises the sensitive nature of the site and the use of \'virtual\' objects allows for the protection of existing fossils and features hidden within the landscape. Ensuring that visitors leave only footprints.\n\n36\n\nImage: Dinosaur Coast Management Group\n\nImage: Andrew Seabourne\n\nImage: Robert Zugaro\n\n2.\n\nImage: Unknown\n\n1.\n\n3.\n\n4.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nCAPE PATERSON - INVERLOCH ROAD\n\nEXISTING\n\nCARPARK\n\nKey Moves – Entry experience to pathway to\n\nprovide sense of arrival and gateway to the digital dinosaur experience; QR codes and Augmented Reality to be embedded in the landscape.\n\n– Each apex provides opportunity for\n\nsculptural intervention. View lines to be enhanced and provide different experiences as users descend down stair case.\n\n– Augmented reality and digital treasure\n\nhunt highlights unique features in the landscape encouraging visitors to explore and search for hidden treasures throughout the site. – Signage and wayfinding to be\n\ninteractive and engage users as they travel down onto the beach.\n\n– Opportunity for totem/signage on\n\nCape Paterson-Inverloch Road to act as wayfinding device and provide physical locator of the site.\n\n– Existing carpark to be reconfigured to tolerate increased visitation and possible shuttle bus.\n\nLegend\n\nEntry/arrival experience; sculptural element and digital platform (QR code) Activated path edges provide information and narrative Recommend carpark be reconfigured to incorporate higher use and shuttle bus Physical sculptural intervention to be embedded in landscape adjacent path Digital discovery element embedded within the landscape\n\nPhysical site locator/wayfinding\n\nKey installation sightline/viewpoint\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nO C KSHELF AND POOLS\n\nE X P L O R A T\n\nT A L\n\nI O N\n\nO R\n\nCONNEC T I O N T J O U R N E Y O F D I G I\n\nA\n\n0\n\n12.5\n\n25m\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n37\n\nEAGLES NEST\n\nFOSSIL FRAGMENTS...\n\nSHOWCASING THE DIVERSE RANGE OF POLAR DINOSAUR FOSSILS AND REMAINS FROM 125 MILLION YEARS AGO, BURIED IN LAYERS OF ROCK\n\nStory A diverse range of dinosaur fossilised remains have been discovered along the Bass Coast, many being isolated bones and teeth. However, these are only part of the fossil picture. A range of other fossilised remains continue to be found including shells, feathers, leaves, invertebrates, coprolites, burrows and footprints.\n\nSeeing the remains of life from 125 million years ago buried in rock, in the very ground on which we stand, reminds us that Country connects us all, regardless of time.\n\nThe Bunurong, the Traditional Custodians of the Bass Coast area have cared for Country for thousands of years, the same Country that contains the diverse fossil remains of the past dinosaur life, and supports life today and into the future.\n\nKey Cultural Interests\n\nAn exhibition of the variety of polar dinosaur fossil discoveries. The ‘Cape Paterson Claw’, Australia’s first dinosaur fossil, was discovered in 1903 by William Ferguson near the Eagles Nest site. This was the first evidence that dinosaurs once inhabited Australia.\n\nEagles Nest refers very directly to Bunjil, the creator, who inhabited this place because of its great vistas along the coast, both west towards Cape Woolamai and east towards the Wilsons Promontory.\n\nViewing the layers of time; framing dramatic coastal views, geological rock formations and intertidal Cretaceous rock platforms\n\n40\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©FOSSILFRAGMENTSHassell ©\n\nSite Personality The cultural significance of this site suggests the solution should focus on embedded elements that provide deep and rich experience of place, time and Country.\n\nProposed exploration of digital platforms, QR codes and augmented or virtual reality design responses can include stories about the Bunurong connection to Country, the very ground in which Australia’s first dinosaur fossil was', 'doc_id': 'cbcd5a2b-559c-4920-b41e-46a07632c0d8', '__type__': '1', 'doc_hash': 'ef437a1af804ff96fbd6ce7a332c1cb78262130783ce818faf934a9fef320109', 'embedding': None, 'node_info': {'end': 40009, 'start': 26691}, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '2': 'fb9fc146-1245-4985-a92e-5ae4bf333e5f', '3': 'f0c358df-86e3-4dea-b4af-54db0d062d19'}}, 'e40ffff6-1b66-4f0c-a22f-d988007aafab': {'text': "and seek responses that outline a message to preserve and care for our natural environment.\n\nThe site offers dramatic views along the coastline and across to Phillip Island and provide opportunity to harness the wind within the creative responses. Located approximately 2km west of the Kilcunda site, ‘The Arch’ is a significant location for dinosaur fossil discoveries and access needs to be considered.\n\nProposed renewal of visitor amenities, playground and future skatepark provide the canvas for creative proposition to be integrated into the planned upgrades. Opportunity to create a minimal impact civic foreshore precinct for visitors to stop and explore. Limited planning restrictions offer flexibility, however community engagement is key.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n53\n\n0\n\n25\n\n50m\n\nBASS HWYKILCUNDA BEACH\n\nKILCUNDA\n\nFORCES OF NATURE AND TIME...\n\nEXPRESSION OF THE SITE’S NATURAL ELEMENTS, UNIQUE GEOLOGY AND HOW FOSSILS ARE FORMED THROUGH LAYERING OVER TIME - EARTH. MOTHER NATURE. COUNTRY.\n\nPrecedents\n\n1. Tudela\n\n\n\nCulip Restoration Project by\n\nEMF + Ardevol\n\n2. Dinosaur footprints, Dinosaur Park\n\nby TBLD\n\n3. Moving Memories Memorial by Jones\n\nStudio and coLAB Studio\n\n4. Rosebud Foreshore Playground by\n\nHassell Studio\n\nHow it could look 1. Creative responses are integrated within planned infrastructure upgrades of the site and express the site's natural elements; wind, water and earth. Kinetic elements, shadow lines and embedded design propositions express the narrative of geology, evolutionary processes and its significance in the formation of fossils. Low impact installations outline a message to preserve and care for our natural environment.\n\n2. The future skate and play\n\ndevelopment at Kilcunda provides an opportunity for connection with Dinosaurs Trail Creative and wayfinding elements. This creative work tells the story of deep time, polar dinosaurs and express the narrative of layering over time and connection to Country, allowing children to engage and play whilst connecting knowledge and stories that celebrate and explain this unique landscape.\n\n3. Interpretive elements and digital layers explore the idea of 'deep time', prompting visitors to consider their role in shaping a sustainable future. The name ‘serendip’ from Serendipiceratops is a synonym for ‘lucky’, and reminds us that whilst there is an element of luck when it comes to finding fossils, it requires a concerted effort by many, and so too does shaping a sustainable future.\n\n54\n\nImage: a+t research group\n\nImage: Ross Franklin\n\nImage: Bild Group\n\n2.\n\nImage: Stephen Tan\n\n1.\n\n3.\n\n4.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nKey Moves – Creative elements are to be\n\nintegrated and embedded within existing and planned upgrade of infrastructure within the site and harness the site's natural elements, geology and coastal views.\n\n– Existing shelter and picnic facilities to be upgraded and include integrated wayfinding, signage and educational elements. Opportunity for open lawn/ civic space to connect shelter with proposed playground and skatepark – creating a civic foreshore precinct.\n\n– Opportunity for totem/signage elements to be located within proposed playspace and adjacent to Nyora-Wonthaggi Rail Trail to act as wayfinding device and provide physical locator of the site.\n\n– Upgrades to pedestrian pathways improve connectivity and help to protect and preserve the unique coastal environment.\n\n– Carpark design to be optimised for effective use of space and to accommodate increased visitation.\n\nLegend\n\nSignage, wayfinding and education elements to be located within existing shelter, suggested upgrade and integration to shelter\n\nS\n\nS\n\nE\n\nC\n\nC\n\nA\n\nC H\n\nA\n\nB E\n\nProposed village green and civic space to link with proposed playground Future playground to incorporate intergrated dinosaur themed play Recommend carpark be reconfigured to incorporate higher use\n\nEmbbed and integrated creative\n\nelements within play space\n\nSculptural element situated along\n\nNyora\n\n\n\nWonthaggi rail trail\n\nPhysical site locator/wayfinding\n\nKey sightline\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nFUTURE\n\nPLAYGROUND\n\nC\n\nO\n\nN\n\nN\n\nCIVIC S\n\nE\n\nC\n\nFUTURE\n\nSKATEPARK\n\nP\n\nA\n\nC\n\nT P\n\nL\n\nE + C\n\nA\n\nY\n\nS\n\nO\n\nP\n\nA\n\nC\n\nA\n\nS\n\nE T\n\nTLIN\n\nO\n\nE\n\nPROPOSED\n\nCARPARK\n\nP\n\nR\n\nO\n\nP\n\nO\n\nSE\n\nD\n\nP E DESTRIAN LINKAGE\n\nEXISTING\n\nCARPARK\n\n0\n\n25\n\n50m\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n55\n\nBASS HWYBASS COAST RAIL TRAIL\n\nSAN REMO\n\nDISTINCT AND DIVERSE...\n\nCELEBRATING THE VARIETY OF POLAR DINOSAURS DISCOVERED ALONG THE BASS COAST, AND THE GLOBAL SIGNIFICANCE OF THIS STRETCH OF COASTLINE\n\nKey Cultural Interests\n\nHighlighting the vast array and unique diversity of polar dinosaurs and pre-historic mammals discovered along the Bass Coast\n\nVisual expression of Bass Strait and the relationship between Australia and Antarctica approximately 125 million years ago\n\nStory An incredible array of polar dinosaurs has been discovered along the Bass Coast, including some found nowhere else on earth. The diversity of these dinosaurs will be showcased, enabling visitors to see the remarkable collection of dinosaurs discovered within the region.\n\nThe San Remo site presents significant opportunity for community integration and partnerships with schools and the academic curriculum; educating users about the uniqueness of polar dinosaur fossils, their history and the global significance of this stretch of coastline.\n\nIn revealing the diversity of dinosaurs the installation(s) explores how scientists and others reconstruct dinosaurs from tiny bone fragments.\n\nThe story also showcases the diversity of other animals that have been discovered along the coastline, including the oldest and most diverse Australian mammal fossils, and Koolasuchus cleelandi, the last of a group of giant amphibians.\n\n58\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©DISTINCTAND DIVERSEHassell ©\n\nPersonality\n\nSan Remo is a key site, connected to the community and tourism, an ideal place to explore what defines a dinosaur is, and how we ‘know’ what they may have looked like. The existing playground and open space lends itself to an expansive and playful, installation that visually showcases the diversity of polar wildlife and what they could have looked like.\n\nThe Lions Park site provides a visual connection to the beach, the site where Koolasuchus cleelandi was discovered. The Early Cretaceous sedimentary rocks here that represent sediments that accumulated approximately 125 million years ago. The expansive nature of the site, existing vegetation and pedestrian linkages provide the canvas for a series of creative responses unlike anything else along the trail.\n\nSite Considerations 1. Existing Lions Parkpublic toilets, shelter and picnic facilities\n\n2. Existing Lions Park playground\n\n3. San Remo meditation labyrinth\n\n4. Sheltered bench seat and viewing\n\nlocation\n\n5. Open lawn space used for weddings\n\nand other functions\n\n6. Existing Lions Park back beach\n\ncarpark\n\n7. Future YBAIP trailhead and signage/\n\nwayfinding\n\n8. Stair access to San Remo back\n\nbeach\n\n9. Early Cretaceous rock at San Remo\n\nBack Beach\n\n1\n\n2\n\n3\n\n5\n\n4\n\nOPEN LAWN\n\n6\n\n8\n\n7\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\n9\n\nHassell ©\n\n0\n\n50\n\n100m\n\n59\n\nBACK BEACH RD SHETLAND HEIGHTS RD\n\nSAN REMO\n\nLIONS PARK\n\nCELEBRATING THE VARIETY OF POLAR DINOSAURS DISCOVERED ALONG THE BASS COAST, AND THE GLOBAL SIGNIFICANCE OF THIS STRETCH OF COASTLINE\n\nPrecedents 1. The Language of Things, USA by\n\nClaudia Comte\n\n2. Nelson Mandela Memorial, South\n\nAfrica by Marco Cianfanelli\n\n3. 360° Viewpoint by WaterScales\n\nArquitectos\n\n4. Sellwood Bridge Gateway: Stratum by\n\nMikyoung Kim Design\n\nHow it could look 1. There is potential for multiple\n\nsculptural elements to be situated within the landscape between Lions Park and San Remo beach, illustrating the distinct diversity of polar dinosaurs along the Bass Coast. Artistic interpretation and abstract representation of different dinosaur species provides an insight into what we know about their behaviour and form - encouraging a journey of discovery and palaeontology.\n\n2. A physical installation frames key views from San Remo back beach providing visual expression of Bass Strait and the relationship between Australia and Antarctica from approximately 125 million years ago. Linked with digital platforms, augmented reality tells the story of Gondwana, framing the entire Dinosaurs Trail experience. 3. A digital platform or augmented reality highlights the discovery of Koolasuchus at the site and directs visitors to the 125 million old Cretaceous rock that can be seen nearby. Scanning these rocks unlocks a digital 'Herd' to appear, enabling visitors to explore the beach and interact with the dinosaurs within a virtual environment. Changing their patterns, colours, scale or feathers.\n\n60\n\nImage: Claudia Comte\n\nImage: Marco Cianfanelli\n\n2.\n\nImage: Fernando Alda\n\n3.\n\nImage: Josh Partee\n\n1.\n\n4.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nKey Moves – Multiple sculptural elements to be situated along pathway from Lion’s Park playground to San Remo Back Beach, linking the two locations and activating the entire length of the site, providing an educational narrative between the two locations. – Installation and educational\n\nopportunities to harness views to Cretaceous rock at San Remo Back Beach. Open space to provide platform for school and tourist group meeting point and educational space; presentations, school curriculum activities etc.\n\n– Existing shelter and picnic facilities provide opportunity for signage and wayfinding elements to be integrated into existing structure.\n\n– Opportunity for totem/signage at\n\nexisting Lion’s Park Playground and San Remo Back Beach car park to provide physical locator of the site.\n\nLegend\n\nSignage, wayfinding elements to be located within existing shelter Education space; proposed sculptural and intepretive elements\n\nExisting lawn space to be retained\n\nPhysical sculptural intervention and\n\nsightline marker\n\nPhysical sculptural interventions\n\nsituated along pathway connecting\n\nplayground to beach access\n\nPhysical site locator/wayfinding\n\nKey sightline\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nEXISTING\n\nPLAYGROUND\n\nOPEN LAWN TO\n\nBE RETAINED\n\nK\n\nC\n\nO\n\nS R\n\nU\n\nO\n\nE\n\nC\n\nA\n\nT\n\nE\n\nR\n\nO C\n\nE T\n\nLIN\n\nT\n\nH\n\nY SIG\n\nE\n\nK\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n61\n\n0\n\n0\n\n50\n\n50\n\n100m\n\n100m\n\nSAN REMO\n\nTOWN CENTRE\n\nCELEBRATING THE VARIETY OF POLAR DINOSAURS DISCOVERED ALONG THE BASS COAST, AND THE GLOBAL SIGNIFICANCE OF THIS STRETCH OF COASTLINE\n\nPrecedents 1. New Park in Leopoldov, Slovakia, by\n\nN\n\n\n\n1\n\n2. Albany Loop, USA by Groundworks\n\nOffice\n\n3. Hobsonville Point Habitat Markers,\n\nNew Zealand by Isthmus\n\nHow it could look 1. There is opportunity for large scale sculptural forms and artworks to provide a clear and visible beacon from Phillip Island Road and the San Remo bridge. The artworks are distinct and diverse in their form, acting as wayfinding devices, connecting users from the foreshore to the township of San Remo. The installations act as a gateway to 'Dinosaur Country' and interact with the existing sculptural pieces on the San Remo foreshore.\n\n2. The existing playground may provide\n\nan opportunity for sculptural and artistic play elements. The installations could tell stories of different polar dinosaur species and educate users on the global significance of this stretch of coastline.\n\nImage: Ján Kekeli\n\n1.\n\n62\n\nImage: Caitlin Atkinson\n\n2.\n\nImage: David St George\n\n3.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nKey Moves Located in close proximity to San Remo Foreshore playground and picnic facilities 1. Visibility from Phillip Island Road to\n\ncatch 'incidental' visitors and support additional tourism opportunities 2. Provide a pedestrian friendly link\n\nto the San Remo commercial/retail precinct and a connection to the township\n\n3. Close proximity to existing playground\n\nprovides experiential play and sculptural integration opportunities 4. Adjacent to existing car parking and\n\nshuttle bus opportunities\n\nLegend\n\nSignage, wayfinding elements to be located within existing shelter Existing playground to incorporate intergrated dinosaur themed play or sculpture Carpark to be considered for shuttle bus pick up/drop off locatio\n\nPhysical site locator/wayfinding\n\nKey sightline from Phillip Island Rd to capture 'incidental' visitors\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nSAN REMO\n\nFORESHORE\n\nRESERVE\n\nPHILLIP ISLAND RD\n\nMARINE PARADE\n\nCONNECTION TO\n\nSAN REMO SHOPS\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n63\n\n0\n\n50\n\n100m\n\nTHE ENTIRE DINOSAUR EXPERIENCE\n\nA Regional Tourism Experience The Bass Coast Dinosaurs Trail provides a new", 'doc_id': 'e40ffff6-1b66-4f0c-a22f-d988007aafab', '__type__': '1', 'doc_hash': 'a639ebed1976302644738a5c4fce73d9c22cc28965eb0c5e782ff9d25a34616c', 'embedding': None, 'node_info': {'end': 65988, 'start': 53004}, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '2': 'f0c358df-86e3-4dea-b4af-54db0d062d19', '3': 'bb5d3ec5-8311-45b0-9e4e-9807d19368e0'}}, 'f0c358df-86e3-4dea-b4af-54db0d062d19': {'text': "this place because of its great vistas along the coast, both west towards Cape Woolamai and east towards the Wilsons Promontory.\n\nViewing the layers of time; framing dramatic coastal views, geological rock formations and intertidal Cretaceous rock platforms\n\n40\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©FOSSILFRAGMENTSHassell ©\n\nSite Personality The cultural significance of this site suggests the solution should focus on embedded elements that provide deep and rich experience of place, time and Country.\n\nProposed exploration of digital platforms, QR codes and augmented or virtual reality design responses can include stories about the Bunurong connection to Country, the very ground in which Australia’s first dinosaur fossil was found, and allow visitors to explore the myriad of fossils along the coast.\n\nThe cultural significance of this site precludes large scale infrastructure propositions. It is an existing tourist destination, rich with geological value, existing site facilities and beach access. Current plans to redevelop access and infrastructure as part of the Yallock-Bulluk Marine and Coastal Park Access and Infrastructure Plan are key factors.\n\nSite Considerations 1. Existing Eagles Nest car parking\n\n2. Existing shelter, signage and day\n\nfacilities. Proposed improvements to universal access, seating and signage as part of YBAIP\n\n3. Bunurong Marine National Park singage and information board\n\n4. Beach and tidal rock shelf access\n\nvia stairs\n\n5. Key viewlines east to The Caves\n\n6. Key viewlines south to Bass Strait\n\n7. Open lawn\n\n8. Bass Coast Whale Discovery Trail\n\nsignage\n\n9. Eagles Nest lookout. Proposed\n\nimprovements viewing platform as\n\npart of YBAIP\n\n1\n\n1\n\nOPEN LAWN\n\nAND SHELTER\n\n2\n\n3\n\n6\n\n7\n\n8\n\n4\n\n5\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n41\n\n9\n\n0\n\n25\n\n50m\n\nCAPE PATERSON-INVERLOCH ROAD\n\nEAGLES NEST\n\nFOSSIL FRAGMENTS...\n\nSHOWCASING THE DIVERSE RANGE OF POLAR DINOSAUR FOSSILS AND REMAINS FROM 125 MILLION YEARS AGO, BURIED IN LAYERS OF ROCK\n\nPrecedents 1. Dinosaur Coast Track Guide augmented reality, Broome\n\n2. Astronomy/Stargazing augmented\n\nreality mobile application\n\n3. Viewfinder, Sculpture By The Sea\n\nBondi 2019 by Joel Adler\n\nHow it could look 1. Visitors are invited to walk across an extensive virtual fossil field, as they explore, augmented reality enables visitors to find and identify a diversity of tracks, footprints, bone fragments, jaws, teeth, leaves and feathers each based on real fossils found along the coast. Hidden amongst the virtual fossils is the Cape Paterson Claw, discovered at the site in 1903, the question is, can you find it? Once discovered, a multitude of digital dinosaur characters are brought to life dramatically, exploring the site, and interacting with visitors.\n\n2. A virtual reality experience illustrates how the Eagles Nest site may have looked during the time of the polar dinosaurs, framing key views east and west. The dramatic views along the coastline are contrasted by depictions of Australia reconnected to Antarctica. A visual story illustrates fossil formation process from is very inception 125 million years ago, all the way until present day.\n\nImage: Andrew Seabourne\n\n42\n\nImage: Jack Fusco\n\n2.\n\nImage: John McDonald\n\n1.\n\n3.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nKey Moves – Key view lines east and west to be framed through digital platforms. Opportunity for embedded landscape elements to act as navigational tools to support these locations and views. – Existing shelter provides opportunity for signage and wayfinding elements to be integrated with a ‘light physical touch’.\n\n– Visual connection from carpark to link both digital and sculptural elements.\n\n– Opportunity for totem/signage on\n\nCape Paterson-Inverloch Road to act as wayfinding device and provide physical locator of the site.\n\nLegend\n\nSignage, wayfinding and instructions to be located within existing shelter Entry/arrival experience; sculptural element and digital platform (QR code)\n\nExisting lawn space to be retained\n\nDigital and small scale physical intervention and sightline marker\n\nPhysical site locator/wayfinding\n\nKey sightline\n\nMajor pedestrian connection\n\nSecondary pedestrian connection\n\nExisting vegetation\n\nH\n\nC\n\nA\n\nE\n\nB\n\nO\n\nT\n\nS\n\nS\n\nE\n\nC\n\nC\n\nA\n\nEXISTING\n\nCARPARK\n\nL\n\nI\n\nN\n\nK\n\nT\n\nO CARPARK\n\nOPEN LAWN TO\n\nBE RETAINED\n\nACCESS TO LOOK O\n\nUT\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n43\n\n0\n\n25\n\n50m\n\nCAPE PATERSON-INVERLOCH ROAD\n\nWONTHAGGI\n\nPAST POLAR INSIGHTS...\n\nAN EXHIBITION OF THE LANDSCAPE AND ENVIRONMENT THAT POLAR DINOSAURS INHABITED 125 MILLION YEARS AGO\n\nKey Cultural Interests\n\nAn exhibition of the landscape in which polar dinosaurs would've inhabited, showcasing the uniqueness of megafauna and a prehistoric environment\n\nProvide a link between the Wonthaggi's mining significance and the coal deposits that are the remains of trees and other vegetation from 125 million years ago\n\n‘Wonthaggi’, which translates into ‘Home’ and reference to the significance of this place as a ceremonial meeting ground for the Bunurong and neighbouring clans.\n\nStory The environment of the polar dinosaurs 125 million years ago would have been very different to what is seen along the Bass Coast today.\n\nThough Australia was located much further south and closer to the Southern Pole than it is today, it is thought the climate was mild rather than Antarctic, more like the cool, temperate areas of Tasmania. There was something special about this polar environment that enabled some dinosaurs and large amphibians to continue to survive, long after they had become extinct elsewhere in the world.\n\nUnderstanding the environment helps scientists understand the dinosaurs themselves. The coal from the area is fossilised vegetation from the same time as the dinosaurs. This provides a link to talk about dinosaur habitat. Incredibly, if you hold a lump of coal mined from Wonthaggi, you are touching what was one a dinosaur’s home and its food!\n\nThe polar dinosaurs lived under the same Southern Lights that can be seen from the Bass Coast today.\n\n46\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©POLAR INSIGHTSHassell ©PAST\n\n1\n\n2\n\n5\n\n4\n\n3\n\n6\n\nNUMBER 5 BRACE\n\nPRECINCT\n\n1\n\nGUIDE PARK\n\n7\n\nSite Considerations\n\n1. Nyora\n\n\n\nWonthaggi Rail Trail\n\n2. Rescue Station Arts Centre provides connection with proposed Yallock Bulluk infrastructure and existing rail trail and town centre\n\n3. Wonthaggi Wetlands Reserve\n\n4. Temporal wetlands\n\n5. Open grassland (Parks Victoria).\n\nProposed cultural stomping ground location as part of YBAIP\n\n6. Remains of Number 5 Brace\n\n7. Guide Park site provides intersection\n\nbetween the rail trail, upgraded playground and Wonthaggi Town Centre\n\n8. Connection to YBAIP and access through to Wonthaggi Bushland Reserve and Wonthaggi Heathland\n\nSite Personality The site provides opportunity for a dramatic, large-scale sculptural and landscape installation that visually demonstrates the link between coal and dinosaurs. The installation immerses visitors in the past polar environment, including the plants and animals that lived alongside the dinosaurs.\n\nThe specific site is yet to be confirmed, although the chosen site should provide a connection between mining and the coal deposits that are the remains of trees and other vegetation from 125 million years ago - Wonthaggi’s link to the Dinosaurs Trail. The site should provide artistic freedom to create large scale immersive installations in line with the site story and site personality\n\nGuide Park is undergoing significant redevelopment and presents an additional location for consideration, with opportunity for the Dinosaurs Trail project to work in with the redeveloped park precinct.\n\n8\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n47\n\n0\n\n50\n\n100m\n\nGRAHAM STW AREA RDMURRAY STS DUDLEY RDBASS COAST RAIL TRAIL\n\nWONTHAGGI\n\nPAST POLAR INSIGHTS...\n\nAN EXHIBITION OF THE LANDSCAPE AND ENVIRONMENT THAT POLAR DINOSAURS INHABITED 125 MILLION YEARS AGO\n\nPrecedents 1. Monash Earth Science Garden,\n\nClayton by Rush Wright Associates 2. Fish Lane Town Square, Brisbane by\n\nby RPS Group\n\n3. Australian Garden, Cranbourne by\n\nTCL\n\n4. Australian Garden, Cranbourne by\n\nTCL\n\nHow it could look 1. Gondwana Gardens. Large sculptural forms and a prehistoric planting palette showcases the uniqueness of vegetation from 125 million years ago and the landscape in which polar dinosaurs once inhabited. Dinosaur's can be seen feeding on plants that would later become the coal. Along the way, fossil material embedded in sculptural forms contain cast fossils that reveal what their environment tells us about the dinosaurs and, what happened to them.\n\n2. Interactive sculptural elements and interpretive installations illustrate and explain the connection between the coal formation process and the remains of trees and other vegetation from 125 million years ago. Digital layers help visitors visualise the lifecycle of plant matter; submerged in swamp environments, broken down, pressurised and transform into coal over millions of years. This coal could then be mined from the Wonthaggi site and provide a link to the township's mining history.\n\nImage: John Gollings\n\nImage: Scott Burrows\n\n2.\n\n48\n\nImage: John Gollings\n\n2.\n\n3.\n\nImage: Ben Wrigley\n\n1.\n\n4.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nPrecedents 1. Botanica: Contemporary Art Outside,\n\nBrisbane\n\n2. Yarra River Projections at White\n\nNight, Melbourne\n\n3. Electric Desert at Phoenix Botanical\n\nGardens, USA\n\nSound and Light Concept\n\nA sound and light installation illustrates some of the creative possibilities for the Bass Coast Dinosaurs Trail.\n\nSound and light can be developed in a partnership with the Bunurong Land Council Aboriginal Corporation and local community to help tell their stories through art at the Gondwana garden to be created as part of the project.\n\nA Sound and Light Show in Wonthaggi would offer a world class experience within the Dinosaurs Trail and link science, Aboriginal culture and history. The collaborative work would support the Bass Coast Dinosaurs Trail experience and become a key visitor experience for the region.\n\nImage: Graham Smith\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\nImage: Craig Walsh\n\n2.\n\nImage: Unknown\n\n1.\n\n3.\n\n2.\n\n49\n\nKILCUNDA\n\nFORCES OF NATURE AND TIME...\n\nEXPRESSION OF THE SITE’S NATURAL ELEMENTS, UNIQUE GEOLOGY AND HOW FOSSILS ARE FORMED THROUGH LAYERING OVER TIME - EARTH. MOTHER NATURE. COUNTRY.\n\nStory What can the polar dinosaurs teach us about ourselves and the world we live in today?\n\nPerhaps the biggest lesson they offer is contained within the rock that encases their fossilised remains. Earth. Mother Nature. Country. The ground beneath us continues to shift as time marches on largely indiscernible, like the evolutionary process that led a group of dinosaurs to become today’s birds, including penguins.\n\nWe are all connected to Country, regardless of time. Dinosaurs prompt us to think about our rapidly changing climate and our role in caring for Country to ensure a sustainable future.\n\nKey Cultural Interests\n\nExpression of the site’s natural elements, unique geology and how fossils are formed through layering over time - highlighting the rugged coastline, unique environment, exaggerated topography and dramatic coastal views.\n\n“The Arch”is situated between Anderson and Kilcunda and has a history of revealing interesting bones; including the holotype of Serendipaceratops, a theropod tooth and an ankylosaur scute.\n\n52\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©FORCES OFNATUREHassell ©\n\n2\n\n1\n\n3\n\n4\n\n6\n\nPLAYGROUND AND\n\nSKATEPARK\n\n5\n\n8\n\n7\n\n1\n\n9\n\nSite Considerations 1. Bass Coast Rail Trail and connection\n\nto YBAIP\n\n2. Connection to Kilcunda Holiday Park\n\n3. Existing toilets\n\n4. Existing shelter, BBQ and seating\n\n5. Existing playground (to be to\n\nrenewed with township skatepark)\n\n6. Kilcunda beach access via stairs\n\n7. Existing beach carpark\n\n8. Key viewlines to Bass Strait\n\n9. Kilcunda Beach access via stairs\n\nSite Personality The expansive, elevated views and exposed nature of the site provide a perfect setting to prompt visitors to consider deep time and our role as custodians of the Earth. Artworks and creative installations are to be low impact and seek responses that outline a message to preserve and care for our natural environment.\n\nThe site offers dramatic views along the coastline and across to Phillip Island and provide opportunity to harness the wind within the creative responses. Located approximately 2km west of the Kilcunda site, ‘The Arch’ is a significant location for dinosaur fossil discoveries and access needs to be considered.\n\nProposed renewal of visitor amenities, playground and future skatepark provide the canvas for creative proposition to be integrated into the planned upgrades. Opportunity to create a minimal impact civic foreshore precinct for visitors to stop and explore. Limited planning restrictions offer flexibility, however community engagement is key.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September", 'doc_id': 'f0c358df-86e3-4dea-b4af-54db0d062d19', '__type__': '1', 'doc_hash': 'e6089f5bb1501797de0ce5fc673ddd1e87a74e100e1a54308a750943463902f0', 'embedding': None, 'node_info': {'end': 53037, 'start': 39858}, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '2': 'cbcd5a2b-559c-4920-b41e-46a07632c0d8', '3': 'e40ffff6-1b66-4f0c-a22f-d988007aafab'}}, 'fb9fc146-1245-4985-a92e-5ae4bf333e5f': {'text': 'Great Russian Dinosaurs exhibition around Australia in 1993. Qantassaurus had to cope with the long periods of Antarctic winter darkness and have survived temperatures well below 0 degrees Celsius.\n\nSerendipaceratops arthurcclarkei was discovered by Mike Cleeland at the Arch, near Kilcunda, in the Strzelecki formation, Victoria in 1993. It is the first representative of the ceratopsians to be found in Australia. The only known bone of Serendipaceratops is an ulna (forearm bone) and it is widely agreed that it is a primitive species of horned/frilled dinosaur like Protoceratops.\n\nBass Coast Dinosaurs Trail\n\nMasterplan, September 2021\n\nHassell ©\n\n13\n\nSITE LOCATIONS\n\nDINOSAURS TRAIL\n\nSAN\n\nREMO\n\nKILCUNDA\n\nWONTHAGGI\n\nEAGLES\n\nNEST\n\nTHE\n\nCAVES\n\nINVERLOCH\n\n“The Bass Coast Dinosaurs Trail peels back the layers of earth, life and time over millions of years and re-imagines them in a contemporary setting.” Bass Coast Dinosaurs Trail Creative Opportunities, Bass Coast Shire Council, 2020\n\nThe trail is a creative, interactive and sensory experience consisting of six sites located from San Remo to Inverloch.\n\nIndividually each site is unique and present as standalone destinations. Although when combined, all six sites present a connected journey of dinosaur experiences and learning. Stitched together by an overarching narrative of discovery and exploration.\n\nThe planning of each site has been approached to enable each site to play to its strengths and to provide different but complementary experiences of the overall narrative. The experience of one site differs to another but when combined the overall collective experience is amplified.\n\nS\n\nR\n\nU\n\nA\n\nS\n\nO\n\nN\n\nI\n\nD\n\nY\n\nT\n\nI\n\nN\n\nU\n\nM\n\nM\n\nO\n\nC\n\nE\n\nR\n\nU\n\nT\n\nL\n\nU\n\nC\n\nN\n\nO\n\nI\n\nT\n\nA\n\nT\n\nE\n\nG\n\nE\n\nV\n\nL\n\nA\n\nO\n\nC\n\n16\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nKILCUNDA\n\ne\n\nr\n\no\n\nh\n\ns\n\ne\n\nr\n\no\n\nF\n\nh\n\nc\n\na\n\ne\n\nB\n\na\n\nd\n\nn\n\nu\n\nc\n\nl\n\ni\n\nK\n\nSAN REMO\n\no\n\nm\n\ne\n\nR\n\nn\n\na\n\nS\n\n,\n\nk\n\nr\n\na\n\nP\n\ns\n\nn\n\no\n\ni\n\nL\n\nLOCATION The Bass Coast is one of Victoria’s most iconic tourism destinations, renowned for its unique combination of rugged, beautiful coastline and picturesque rural hinterland. Located just over an hour’s drive south-east of Melbourne, the area is connected via the South Gippsland Freeway and Bass Highway.\n\nThe six sites identified for investigation are San Remo, Kilcunda, Wonthaggi, Eagles Nest, The Caves and Inverloch. These locations reflect the breadth of the study area and strategically include multiple townships, whilst individually each site presents its own distinct qualities and characteristics.\n\nWONTHAGGI\n\ni\n\nd\n\ne\n\nn\n\nm\n\nr\n\ne\n\nt\n\ne\n\nd\n\ne\n\nb\n\no\n\nt\n\ne\n\nt\n\ni\n\nS\n\nINVERLOCH\n\nEAGLES NEST\n\nTHE CAVES\n\nh\n\nc\n\no\n\nl\n\nr\n\ne\n\nv\n\nn\n\nI\n\n,\n\nk\n\nr\n\na\n\nP\n\nw\n\no\n\nb\n\nn\n\ni\n\na\n\nR\n\ns\n\ne\n\nv\n\na\n\nC\n\ne\n\nh\n\nT\n\nt\n\ns\n\ne\n\nN\n\ns\n\ne\n\nl\n\ng\n\na\n\nE\n\nKEY CULTURAL INTERESTS\n\nThe trail draws upon a nationally significant body of work and creates a dynamic and creative approach to expressing the environmental and cultural layers of the region. The project will support local needs and drive the arts and sustainable cultural tourism in the region, aligning with the Bass Coast Shire Council Arts and Culture Strategy 2019-29. The key cultural interests of the project are: – Dinosaur Significance – Community Connection – Cultural Heritage – Environmental Value – Coal Formation\n\nThe relative positioning of these key interests are aligned to the six sites. The positioning of each experience to each site is summarised in the site plan on the adjacent page.\n\n18\n\nDINOSAUR SIGNIFICANCE Locations of significant dinosaur discovery and palaeontological importance. Sites that are connected to the exploration and discovery of polar dinosaur fossils, prehistoric fauna found in the region, sites of scientific importance and ongoing dig locations.\n\nCOAL FORMATION Locations significant to the formation of coal. Deposited by rivers and lakes over 125 million years ago, Early Cretaceous sediments accumulated into swamp material would later be compacted over time to form the coal seams located in these areas.\n\nENVIRONMENTAL VALUE Areas of environmental importance, significant coastline and geological foundations. The BCDT will promote responsible use of the coastal environment and highlight the significance and diversity of the natural environment.\n\nCOMMUNITY CONNECTION Sites that are located in close proximity to existing townships and communities. Highlighting locations within the tourism experience where visitors can interact with local business and accommodation offerings in the region.\n\nCULTURAL IMPORTANCE Places of key Aboriginal significance and connection to country. The BCDT is engaging with Bunurong Land Council Aboriginal Corporation to ensure that known locations are protected and the stories and cultural values are complimented by paleontological information and historical dig references.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nSAN REMO\n\nKILCUNDA\n\nWONTHAGGI\n\nLEGEND\n\nINVERLOCH\n\nTHE CAVES\n\nEAGLES NEST\n\nREGIONAL VISITOR EXPERIENCE\n\nThe Bass Coast Dinosaurs Trail will compliment existing tourist destinations, infrastructure, environmental and cultural assets to extend the offer and assist in attracting visitors to the region.\n\nNew tourism activity, particularly in shoulder and off peak periods would assist the region in achieving stable and continued economic growth. Giving Bass Coast the opportunity to continue to capitalise on the long-term trajectory of tourism. Visitors that come to experience the Dinosaurs Trail are likely to expand their activities into townships and surrounding tourism offer.\n\nEconomic Impact As part of the final Masterplan a formal economic impact assessment will be completed to assess the economic opportunities that come with from investment into the Dinosaurs Trail experience.\n\nOverall, the development of the Dinosaurs Trail in Bass Coast can, amongst others: – Enhance the visitor experience; – Increase visitation across the year; – Increase private investment; – Increase regional economic activity; – Raise the brand profile of the region; – Protect and conserve the area’s\n\nnatural and cultural heritage values; and\n\n– Increase, develop and maximise regional tourism/commercial partnerships.\n\nEconomic modelling indicates the Bass Coast Dinosaurs Trail will be a significant job creator for the broader Gippsland region generating hundreds of direct and indirect year-round employment. Refer to appendix A for further information.\n\n20\n\nThese industries that have been particularly devastated by COVID-19 in regional Victoria. The Dinosaurs Trail provides an opportunity for COVID-19 recovery and activate year round visitation, that inputs geo-heritage tourism experience within the arts and culture economy.\n\nThere is opportunity for existing groups such as the Dinosaur Dreaming project to leverage the uplift in visitor experience, generating additional awareness and funding that supports the ongoing research program.\n\nMuseum and Cultural Centre The Bass Coast Dinosaurs Trail presents an opportunity for the development of a Museum/Cultural Centre in Inverloch, a space that incorporates the overarching themes and narrative of the Dinosaurs Trail and also enable a space for ongoing education and research and ensure the sustainability of the Bass Coast Dinosaurs Trail.\n\nThe museum concept development would be considered with the local community and special interest community groups to deliver a multifaceted facility. It presents further opportunities for community participation, as well as science and cultural intercourse. A Museum/ Cultural Centre would explore the connections among scientific knowledge and culture linked with stories.\n\nIt is a chance to extend the Dinosaurs Trail experience, bring together complementary experiences and become a key tourism driver.\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\nSAN REMO\n\nKILCUNDA\n\nWONTHAGGI\n\nLEGEND\n\nINVERLOCH\n\nTHE CAVES\n\nEAGLES NEST\n\nACCESS AND INFRASTRUCTURE\n\nMelbourne is connected to the Bass Coast region by the South Gippsland Hwy and Bass Hwy. All sites can be accessed and serviced by a variety of major and secondary roads networks and car parks, under the management of various authorities.\n\nVehicular access and car parking are facilities managed by either Parks Victoria or the Bass Coast Shire. Consideration of visitor experience via car is essential and some sites may need carparking infrastructure upgrades as a result of increased visitation and tourism. Safe access to the site locations, ability to navigate and meet are all essential accesiblity considerations for each site and its associated car parking.\n\nExisting carparks at the site locations are to be reviewed to ensure they can accommodate higher visitation and a potential electric shuttle bus drop off/ pick up. There is further opportunity to include electric charging spots be implemented at key sites where site carparks are to be reconfigured.\n\nPublic transport San Remo, Kilcunda, Wonthaggi and Inverloch are all connected to Melbourne via the V-Line coach network. Local public transport services further improves on the access options. Existing and future upgrades to walking and cycling infrastructure helps to support and encourage active modes of transport between site locations.\n\nWayfinding and interpretation The creative art installations will be complimented by extensive interpretive wayfinding that compliments the natural landscape and reflects the culture and connection to country of the Bunurong Traditional Owners. Wayfinding signage will guide people through the sites and townships along the Bass Coast Dinosaurs Trail.\n\nIt will feature practical information that provides visitors with relevant mapping, accessibility levels and proximity to towns and amenities. While signage is an obvious wayfinding device, planting palettes, material selection, sound or text based storytelling and embedded elements within the surrounding landscape can also provide direction and orientation.\n\nWayfinding signage would be a vehicle to embed stories and information across the region. The Bunurong stories, cultural values and connection to country would be complimented by paleontological information and historical dig references.\n\nGiven their proximity, the Dinosaurs Trail experience provides significant opportunity for wayfinding and interpretation elements to be integrated with the proposed Yallock-Bulluk Marine and Coastal Park Access and Infrastructure Plan.\n\nFuture Shuttle Bus\n\nThe BCDT presents an opportunity for an electric tourist bus shuttle that circulates between each proposed site location.\n\nProviding access to these sites via shuttle bus will help reduce congestion on local roads, Bunurong Coastal Drive and the associated car parks. Similarly, it will allow visitors from Melbourne to visit the sites without relying on a car, connecting at key community locations such as San Remo, Wonthaggi or Inverloch.\n\nThe shuttle bus has the ability to be connected to the proposed museum and cultural centre at Inverloch, and provide further information and history on the polar dinosaurs as visitors travel between each location. This concept adds an additional layer to the trail experience and forms an essential part of the regional tourism offering.\n\n22\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©\n\n10 MINUTE DR I V E\n\nSAN REMO\n\nKILCUNDA\n\n14 MINUTE DRIVE\n\nWONTHAGGI\n\nLEGEND\n\n12 MINUTE DRIVE\n\n1\n\n2\n\nM\n\nI\n\nN\n\nU\n\nT\n\nE\n\nD\n\nRI\n\nV\n\nE\n\nINVERLOCH\n\nTHE CAVES\n\nTHE CAVES\n\nEAGLES NEST\n\nSITE LOCATIONS\n\nImage: Hassell\n\nINVERLOCH\n\nSCIENCE, ART AND IMAGINATION...\n\nENGAGING USERS IN THE PROCESS OF FINDING, IDENTIFYING EXCAVATING, PREPARING, AND RECONSTRUCTING FOSSILS\n\nKey Themes\n\nEducating users in scientific enquiry and palaeontology - exploring the art and excitement of fossil discovery types and sites. Connecting users to the Bunurong Environment Centre, its dinosaur display and associated Dinosaur Dig Tours.\n\nStory The process of finding, excavating, preparing, identifying, naming reconstructing fossils is fascinating and often capture people’s imagination.\n\nWhat we know about these polar dinosaurs is largely a result of 40 years of research into the fossils carefully and painstakingly extracted and conserved from along the coast, many isolated bones and teeth.\n\nReal life dinosaur detectives; palaeontologists, geologists, and geochemists all piece together clues to build a picture of the dinosaurs and the environments in which they lived. This story of investigation, recovery and conservation extends to the historic Amazon shipwreck buried on the beach nearby.\n\n28\n\nBass Coast Dinosaurs TrailMasterplan, September 2021Hassell ©Hassell ©SCIENCEARTIMAGINATION\n\n1\n\n2\n\n3\n\nWYETH\n\n\n\nMCNAMARA PARK\n\n4\n\n6\n\n5\n\n7\n\nSite Considerations 1. Relationship and proximity to\n\nBunurong Environment Centre and\n\ncarpark\n\n2. Existing Wyeth\n\n\n\nMcNamara Park\n\nshelter, BBQ and seating facilities\n\n3. Ramsey Boulevard parking\n\n4. Wyeth\n\n\n\nMcNamara Park playground\n\nFuture upgrades proposed 2022\n\n\n\n23\n\n5. Existing gym station and exercise\n\nequipment\n\n6. The Glade shelter, BBQ and picnic\n\nfacilities\n\n7. Open lawn of the glade to be\n\nretained. Location of Inverloch\n\nCommunity Farmers Market\n\n8. Existing boardwalk access to\n\nInverloch Beach\n\nWyeth-McNamara Park This site is all about immersing', 'doc_id': 'fb9fc146-1245-4985-a92e-5ae4bf333e5f', '__type__': '1', 'doc_hash': '1b5592222860a04a0ca34f310880819b71eabd1227565d9921c5e4172aea664f', 'embedding': None, 'node_info': {'end': 26603, 'start': 13212}, 'extra_info': None, 'relationships': {'1': 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9', '2': '0b6d768e-1570-45ad-a3a1-c91bbfa6dfd2', '3': 'cbcd5a2b-559c-4920-b41e-46a07632c0d8'}}}, 'ref_doc_info': {'0b6d768e-1570-45ad-a3a1-c91bbfa6dfd2': {'doc_hash': '7416c837cf315bd30c7e319a0cbc0e451f9faa693c044e9f17373b36d0e6519d'}, 'ad71d066-aa4d-4d05-80ba-a4a55ba137e9': {'doc_hash': 'a1ebb9ff38a3de8efe6de455275d10c0fe1fea6a956cba9f6b4fe7360336a794'}, 'bb5d3ec5-8311-45b0-9e4e-9807d19368e0': {'doc_hash': 'da1edb3c7623260de474e40d100b54080ff9586fe2f9ad6681ff1cb2c87d92ed'}, 'cbcd5a2b-559c-4920-b41e-46a07632c0d8': {'doc_hash': 'ef437a1af804ff96fbd6ce7a332c1cb78262130783ce818faf934a9fef320109'}, 'e40ffff6-1b66-4f0c-a22f-d988007aafab': {'doc_hash': 'a639ebed1976302644738a5c4fce73d9c22cc28965eb0c5e782ff9d25a34616c'}, 'f0c358df-86e3-4dea-b4af-54db0d062d19': {'doc_hash': 'e6089f5bb1501797de0ce5fc673ddd1e87a74e100e1a54308a750943463902f0'}, 'fb9fc146-1245-4985-a92e-5ae4bf333e5f': {'doc_hash': '1b5592222860a04a0ca34f310880819b71eabd1227565d9921c5e4172aea664f'}}}, '__type__': 'simple'}, 'index_struct': {'__data__': {'nodes': ['0b6d768e-1570-45ad-a3a1-c91bbfa6dfd2', 'fb9fc146-1245-4985-a92e-5ae4bf333e5f', 'cbcd5a2b-559c-4920-b41e-46a07632c0d8', 'f0c358df-86e3-4dea-b4af-54db0d062d19', 'e40ffff6-1b66-4f0c-a22f-d988007aafab', 'bb5d3ec5-8311-45b0-9e4e-9807d19368e0'], 'summary': None, 'index_id': '8559b57f-431a-4ce1-b335-9f85d1c700b7'}, '__type__': 'list'}}, 'label': 'Bass Coast Dinosaurs Trail Masterplan: Exploring Science, Art, and Imagination', 'state': '', 'blocks': [{'query': 'give this document a title', 'response': 'Bass Coast Dinosaurs Trail Masterplan: Exploring Science, Art, and Imagination'},